<%@ page contentType="text/html;charset=UTF-8" language="java" %>
<%@ taglib prefix="c" uri="http://java.sun.com/jsp/jstl/core"%>
<%@ taglib prefix="fmt" uri="http://java.sun.com/jsp/jstl/fmt"%>

<html>
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>本日の評価</title>
	<link rel="stylesheet" href="<%= request.getContextPath() %>/css/global.css">
	<link rel="stylesheet" href="<%= request.getContextPath() %>/css/resultWeek.css">
    <link href="https://fonts.googleapis.com/css2?family=Manrope:wght@400;500;700&display=swap" rel="stylesheet">
<link rel="icon" type="image/svg+xml" href="data:image/svg+xml,%3Csvg%20xmlns%3D%22http%3A//www.w3.org/2000/svg%22%20width%3D%2224%22%20height%3D%2224%22%3E%3Cpath%20fill%3D%22%2323727B%22%20d%3D%22M0%200h24v24H0V0Z%22/%3E%3Cpath%20fill%3D%22%23284A53%22%20d%3D%22M7.063.734%209.476.727%2012%20.75l2.523-.023%202.415.007%202.214.007C21%201%2021%201%2023%203c.227%201.88.227%201.88.195%204.133l-.02%202.441-.05%202.551-.027%202.574c-.024%202.1-.06%204.2-.098%206.301l-4-1%201-3-1-3%201-2-4%201V9h-3V6c-2.799%202.528-4.458%204.204-5%208H5v2H3l1%205H1c-.054-2.959-.094-5.916-.125-8.875l-.05-2.55-.02-2.442-.032-2.254C1.25.93%203.663.745%207.063.734Z%22/%3E%3Cpath%20fill%3D%22%23F9FAF8%22%20d%3D%22M0%200h24v24H0V0Zm1%203C.707%204.92.707%204.92.77%207.098l.005%202.427.037%202.537.002%202.55C.447%2018.624.447%2018.624%202%2022c1.477.099%202.958.13%204.438.133l2.71.004L12%2022.125l2.852.012%202.71-.004%202.504-.004c1.94.084%201.94.084%202.934-1.129.127-2.99.185-5.947.188-8.938l.037-2.537.005-2.427.013-2.234C23.16%202.754%2023.16%202.754%2021%201%2019.098.691%2019.098.691%2016.937.734L14.524.727%2012%20.75%209.477.727%207.062.734%204.848.741C2.753.846%202.753.846%201%203Z%22/%3E%3Cpath%20fill%3D%22%2306303C%22%20d%3D%22M3%203h17l-4%206h-3V6c-2.799%202.528-4.458%204.204-5%208H5v2H3l1%205H2L3%203Z%22/%3E%3Cpath%20fill%3D%22%237DB0A3%22%20d%3D%22m14%2012%202%203%202-1-1%208H5l1-5h2v-2l6-3Z%22/%3E%3Cpath%20fill%3D%22%23F3F4EF%22%20d%3D%22M0%2021h24v3H0v-3Z%22/%3E%3Cpath%20fill%3D%22%2321717A%22%20d%3D%22M15%2012h5c1.125%205.75%201.125%205.75%200%208l2%202h-5v-7l-2%201v-4Z%22/%3E%3Cpath%20fill%3D%22%23ABC7AF%22%20d%3D%22m15%2018-1%204H6c.313-1.938.313-1.938%201-4%203.29-1.097%204.713-.8%208%200Z%22/%3E%3Cpath%20fill%3D%22%23063946%22%20d%3D%22M5%208h2l1%206H5v2H3l1%205H2c-.125-5.75-.125-5.75%201-8h2V8Z%22/%3E%3Cpath%20fill%3D%22%23156B78%22%20d%3D%22m12%204%202%203-1%202%203%201-8%204c.375-2.438.375-2.438%201-5l2-1c.652-2.025.652-2.025%201-4Z%22/%3E%3Cpath%20fill%3D%22%23358D91%22%20d%3D%22m17%207%201%203c-6.286%204.429-6.286%204.429-10%205l2-3h2l1-2h3l1-3Z%22/%3E%3Cpath%20fill%3D%22%235BA09A%22%20d%3D%22m14%2012%202%203%202-1-1%208h-1v-5h-2v-2l-2-1%202-2Z%22/%3E%3Cpath%20fill%3D%22%23032A36%22%20d%3D%22M21%2011h1v10l-3-1%201-3-1-3%202-3Z%22/%3E%3C/svg%3E">
    
</head>
<body>
    <!-- ヘッダー -->
    <div class="headerH2">
        <h2>今週の評価</h2>
    </div>   

    <!-- 進捗率表示 -->
    <div class="progressContainer">
        <p>今週の達成率</p>
        <div class="progressBar">
            <div class="progressBarFill" style="width: <%=session.getAttribute("level") %>%;"></div>
        </div>
        <p><span><%=session.getAttribute("level") %>%</span></p>
    </div>

    <!-- テキスト -->
    <!-- jspで生成 -->
    <div>
        <p><%=session.getAttribute("feedback") %></p>
    </div>

    <div class="resultText">
        <h1>今週もお疲れさまでした！</h1>
    </div>

    <!-- テキスト -->
    <div>
        <p>来週の自分が、少しでも心地よく過ごせるように、がんばることだけが目標じゃない。<br>安心できるペースで、やりたいことを少しずつ形にしていこう！</p>
    </div>


    <div class="textH2">
        <h2>来週の目標を登録しましょう！</h2>
        <svg width="14" height="18" viewBox="0 0 14 18" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path fill-rule="evenodd" clip-rule="evenodd" d="M7.29871 17.2802C7.15808 17.4206 6.96746 17.4995 6.76871 17.4995C6.56996 17.4995 6.37933 17.4206 6.23871 17.2802L0.238706 11.2802C0.165019 11.2115 0.105917 11.1287 0.0649252 11.0367C0.0239334 10.9447 0.00189209 10.8454 0.000115395 10.7447C-0.0016613 10.644 0.0168629 10.544 0.0545835 10.4506C0.0923042 10.3572 0.14845 10.2724 0.219668 10.2011C0.290887 10.1299 0.375721 10.0738 0.46911 10.036C0.562498 9.99833 0.662525 9.9798 0.763228 9.98158C0.863932 9.98336 0.963246 10.0054 1.05525 10.0464C1.14724 10.0874 1.23005 10.1465 1.29871 10.2202L6.01871 14.9402V0.750172C6.01871 0.55126 6.09772 0.360493 6.23838 0.219841C6.37903 0.0791893 6.56979 0.000171661 6.76871 0.000171661C6.96762 0.000171661 7.15838 0.0791893 7.29904 0.219841C7.43969 0.360493 7.51871 0.55126 7.51871 0.750172V14.9402L12.2387 10.2202C12.3074 10.1465 12.3902 10.0874 12.4822 10.0464C12.5742 10.0054 12.6735 9.98336 12.7742 9.98158C12.8749 9.9798 12.9749 9.99833 13.0683 10.036C13.1617 10.0738 13.2465 10.1299 13.3177 10.2011C13.389 10.2724 13.4451 10.3572 13.4828 10.4506C13.5206 10.544 13.5391 10.644 13.5373 10.7447C13.5355 10.8454 13.5135 10.9447 13.4725 11.0367C13.4315 11.1287 13.3724 11.2115 13.2987 11.2802L7.29871 17.2802Z" fill="black"/>
        </svg>
    </div> 

    <!-- 登録ボタン -->
     <div class="buttonContainer">
        <a href="<%= request.getContextPath() %>/registGoal"><button type="submit" class="button">目標を登録する</button></a>
     </div>

     

    <!-- フッター -->
    <jsp:include page="footerMenu.jsp" />
</body>
</html>